---
kind: method
id: M:Autodesk.Revit.DB.BarTypeDiameterOptions.#ctor
source: html/5aa0bc88-1b77-b112-d752-ec7ebf0aa396.htm
---
# Autodesk.Revit.DB.BarTypeDiameterOptions.#ctor Method

Constructs a new BarTypeDiameterOptions with default settings.

## Syntax (C#)
```csharp
public BarTypeDiameterOptions()
```